---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictRoomOverlapMain
source: html/076780c2-e62f-9795-b6f6-eeee24e44e8e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictRoomOverlapMain Property

Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in the Main Model.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictRoomOverlapMain { get; }
```